Feat: add architecture diagram + Github Actions + sample Excel file
